There's a lot of drift that came through in the apply, but this looks to be done:

```console
$ aws-vault exec artichokeruby-forge-admin -- terraform apply
module.artichoke_ruby_users.github_membership.members["artichoke-ci"]: Refreshing state... [id=artichoke-ruby:artichoke-ci]
module.artichoke_ruby_users.github_membership.admins["lopopolo"]: Refreshing state... [id=artichoke-ruby:lopopolo]
github_repository.artichoke_ci: Refreshing state... [id=artichoke-ci]
github_repository.private_crate_reservation["artichoke"]: Refreshing state... [id=artichoke-reserve]
github_repository.private_crate_reservation["boba"]: Refreshing state... [id=boba-reserve]
github_repository.private_crate_reservation["artichoke-ruby"]: Refreshing state... [id=artichoke-ruby-reserve]
github_repository.private_crate_reservation["artichokeruby"]: Refreshing state... [id=artichokeruby-reserve]
github_repository.private_crate_reservation["invokedynamic"]: Refreshing state... [id=invokedynamic-reserve]
github_repository.raw_parts: Refreshing state... [id=raw-parts]
github_repository.rust_onig: Refreshing state... [id=rust-onig]
github_repository.docker_artichoke_nightly: Refreshing state... [id=docker-artichoke-nightly]
github_repository.onigmo: Refreshing state... [id=Onigmo]
github_repository.boba: Refreshing state... [id=boba]
github_repository.rust_mersenne_twister: Refreshing state... [id=rust-mersenne-twister]
module.team_cratesio_publishers.github_team.this: Refreshing state... [id=4053636]
module.artichoke_users.github_membership.members["artichoke-ci"]: Refreshing state... [id=artichoke:artichoke-ci]
github_repository.intaglio: Refreshing state... [id=intaglio]
github_repository.ruby_file_expand_path: Refreshing state... [id=ruby-file-expand-path]
github_repository.artichoke: Refreshing state... [id=artichoke]
github_repository.jasper: Refreshing state... [id=jasper]
module.artichoke_users.github_membership.admins["lopopolo"]: Refreshing state... [id=artichoke:lopopolo]
github_repository.logo: Refreshing state... [id=logo]
github_repository.oniguruma: Refreshing state... [id=oniguruma]
module.team_ci.github_team.this: Refreshing state... [id=3544139]
github_repository.roe: Refreshing state... [id=roe]
github_repository.strudel: Refreshing state... [id=strudel]
github_repository.nightly: Refreshing state... [id=nightly]
github_repository.playground: Refreshing state... [id=playground]
github_repository.spec: Refreshing state... [id=spec]
github_repository.rand_mt: Refreshing state... [id=rand_mt]
github_repository.mruby: Refreshing state... [id=mruby]
github_repository.mspec: Refreshing state... [id=mspec]
github_repository.ruby: Refreshing state... [id=ruby]
github_repository.artichoke_github_io: Refreshing state... [id=artichoke.github.io]
github_repository.www_artichokeruby_org: Refreshing state... [id=www.artichokeruby.org]
github_repository.clang_format: Refreshing state... [id=clang-format]
github_organization_webhook.discord: Refreshing state... [id=198671336]
github_repository.rubyconf2019_artichoke_run: Refreshing state... [id=rubyconf2019.artichoke.run]
github_repository.ferrocarril: Refreshing state... [id=ferrocarril]
github_repository.project_infrastructure: Refreshing state... [id=project-infrastructure]
github_repository.cactusref: Refreshing state... [id=cactusref]
github_repository.rubyconf: Refreshing state... [id=rubyconf]
github_repository.focaccia: Refreshing state... [id=focaccia]
module.artichokeruby_users.github_membership.members["artichoke-ci"]: Refreshing state... [id=artichokeruby:artichoke-ci]
module.artichokeruby_users.github_membership.admins["lopopolo"]: Refreshing state... [id=artichokeruby:lopopolo]
github_branch_default.rust_onig: Refreshing state... [id=rust-onig]
github_actions_organization_secret.dockerhub_user: Refreshing state... [id=DOCKERHUB_USER]
github_actions_organization_secret.dockerhub_token: Refreshing state... [id=DOCKERHUB_TOKEN]
module.team_cratesio_publishers.github_team_membership.admins["lopopolo"]: Refreshing state... [id=4053636:lopopolo]
module.team_ci.github_team_membership.members["artichoke-ci"]: Refreshing state... [id=3544139:artichoke-ci]
module.team_ci.github_team_membership.admins["lopopolo"]: Refreshing state... [id=3544139:lopopolo]
github_branch_default.spec: Refreshing state... [id=spec]
github_branch_default.mspec: Refreshing state... [id=mspec]
github_branch_default.mruby: Refreshing state... [id=mruby]
github_branch_default.ruby: Refreshing state... [id=ruby]
github_actions_organization_secret.terraform_aws_secret_key: Refreshing state... [id=TF_AWS_SECRET_KEY]
github_actions_organization_secret.terraform_aws_access_key: Refreshing state... [id=TF_AWS_ACCESS_KEY]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # github_repository.project_infrastructure has been changed
  ~ resource "github_repository" "project_infrastructure" {
      ~ etag                   = "W/\"1e8d78e8fa2afeae1a32fcee3797158b455f12edee22bd9c567153ab3a78f443\"" -> "W/\"f672a698c6a5ac3a45dd25338f4c5e50649ea22edce04be3d4dddc6f0824a09d\""
        id                     = "project-infrastructure"
        name                   = "project-infrastructure"
        # (26 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the
following plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.github_branch.github_actions_workflows_audit_base["artichoke"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"046dabb5b0855f625bd60e74a68f80c512d3220088c86b68eeebd898edf1a012\"" -> (known after apply)
      ~ id         = "artichoke:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "19b5b84405270d0cd54bd6c6cd26a17392b6e0ff" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["artichoke_github_io"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"83c00c68ee8fbeee4c94b3cf255670791ae8da82de6cab1aeec2ece71e2b01d4\"" -> (known after apply)
      ~ id         = "artichoke.github.io:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "917b6a5b58d5edc27c2e159d037dbc5a13492f35" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["boba"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"44a97c19814935fdf06f444317b0e118a141225036fb7496c1b9b593096ec375\"" -> (known after apply)
      ~ id         = "boba:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "bd762ac02d31aec82b5c58474ea776bc72b30903" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["cactusref"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"3f957e363d61d91925c47f632f5598e993c4fb14000fd04c8c446c02fd696f9d\"" -> (known after apply)
      ~ id         = "cactusref:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "442210a2316236298d4b1e0b331e56be8c474898" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["clang_format"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"52e7073733b5aee78882984308046a2f47391c6cedd87c0bf70ec8566ccf8e75\"" -> (known after apply)
      ~ id         = "clang-format:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "f016626f6ed327d58be1962848b5a2ec863d3249" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["docker_artichoke_nightly"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"f977ecc8e3bf16c47eed676830b57cdd680c61403fbe0a2d797494fa0d8d609f\"" -> (known after apply)
      ~ id         = "docker-artichoke-nightly:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "a7b93799275bd68ca64ae8fc4c9cb9ae6f4d9711" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["focaccia"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"a8cad0eda41d2e69d9ef70aa8deb5079239625a36a4bc5a89e3ea1daf39075bf\"" -> (known after apply)
      ~ id         = "focaccia:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "8688402966ae0cc4f23ef7647b5bb204e84db770" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["intaglio"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"77bf14192b5310e431d9577e81ad74c0b6896188092c297f958f8135be67795e\"" -> (known after apply)
      ~ id         = "intaglio:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "2f5def690371866a4a45023e29dd48988896f29e" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["jasper"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"17a110c80be1f76f5baa36606e9fa258afc30f1f1ff9ef16d38aeb8a7fc8d2af\"" -> (known after apply)
      ~ id         = "jasper:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "a90d6a40acd86ceff1fbeaca53fc37fce8763c45" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["logo"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"e19a9d1c30be9d80439ee875af5503ff22ae47025e7fb43ebc82db7339966ff4\"" -> (known after apply)
      ~ id         = "logo:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "b503c8bb72960858d3b74d1124ff24026ebdde13" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["nightly"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"005110a61a06e26993865ecae366bdb6c6fa4b84cac6ba1210a91ec660b85722\"" -> (known after apply)
      ~ id         = "nightly:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "b734301c59c6bb67b2b22b50f3b47db4fe9667ee" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["playground"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"934d4457005a3f1f47fbbcb1861d6d2a9888a204d183fabf6a7804c41d70d9d2\"" -> (known after apply)
      ~ id         = "playground:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "6a836b8dd2df6f392632dd468dbf26729dfc70a9" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["project_infrastructure"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"bdb09b685fb5f60581c666af69bec8e3a93c802ea46382742df90a8c65bd6ef8\"" -> (known after apply)
      ~ id         = "project-infrastructure:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "a641fd75d1d59663712fd454fd3e4183f7d0f8f8" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["rand_mt"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"52f0c70522bd3f87b8b880418ca09b3782489eb5bd4f1f5fc374567179ad3651\"" -> (known after apply)
      ~ id         = "rand_mt:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "ff85c23bf1544654ce249d4d9d9394fa9c54d1fa" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["raw_parts"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"d8a36fa0ad75ac1f3da6bff02e7b5901d483b5a1dd3ef4ba21bfc3e8e0b0b7c0\"" -> (known after apply)
      ~ id         = "raw-parts:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "090eb4129d2a72843d3a8b56c8db87b557cae354" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["roe"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"7b5dbd85a0bc22ad5bf785019e6981085bb9a41e73d0ad9cc7f08ed918563aa1\"" -> (known after apply)
      ~ id         = "roe:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "a8a75f9da8cd319b6b76dac67a4d9230ca8de8a9" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["ruby_file_expand_path"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"41e9445e4d3665c12ca1e0514f13f551a3a9e3161aead1dd017fe060264ea19e\"" -> (known after apply)
      ~ id         = "ruby-file-expand-path:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "d242c2eef6887c8ac894c40012aef9fcc0d916ff" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["rubyconf"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"0a34f815f33204367712a24c18752e0d23f4e5711491f57133df2d4f52c82b25\"" -> (known after apply)
      ~ id         = "rubyconf:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "d891e9d149e99096d482bb8e1267a96ade0b242f" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["strudel"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"b523e19497baf8ffb678b19585e3203e5a6e42f237052735e36d0f14367b8c06\"" -> (known after apply)
      ~ id         = "strudel:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "1eb1bfef7a1ff18285c2ef44d9b021df460b8a3c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.github_actions_workflows_audit_base["www_artichokeruby_org"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "github_actions_workflows_audit_base"  {
      ~ etag       = "W/\"7ff0d2858a234018b198c7f6b48d2a2a9c7b2fda4ed7bda46f90f0fe7dc74d25\"" -> (known after apply)
      ~ id         = "www.artichokeruby.org:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "4d0bbf7752c6e908c4cf8ce32572232e20efa5ac" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["artichoke"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"046dabb5b0855f625bd60e74a68f80c512d3220088c86b68eeebd898edf1a012\"" -> (known after apply)
      ~ id         = "artichoke:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "19b5b84405270d0cd54bd6c6cd26a17392b6e0ff" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["artichoke_github_io"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"83c00c68ee8fbeee4c94b3cf255670791ae8da82de6cab1aeec2ece71e2b01d4\"" -> (known after apply)
      ~ id         = "artichoke.github.io:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "917b6a5b58d5edc27c2e159d037dbc5a13492f35" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["boba"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"44a97c19814935fdf06f444317b0e118a141225036fb7496c1b9b593096ec375\"" -> (known after apply)
      ~ id         = "boba:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "bd762ac02d31aec82b5c58474ea776bc72b30903" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["cactusref"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"3f957e363d61d91925c47f632f5598e993c4fb14000fd04c8c446c02fd696f9d\"" -> (known after apply)
      ~ id         = "cactusref:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "442210a2316236298d4b1e0b331e56be8c474898" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["docker_artichoke_nightly"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"f977ecc8e3bf16c47eed676830b57cdd680c61403fbe0a2d797494fa0d8d609f\"" -> (known after apply)
      ~ id         = "docker-artichoke-nightly:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "a7b93799275bd68ca64ae8fc4c9cb9ae6f4d9711" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["focaccia"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"a8cad0eda41d2e69d9ef70aa8deb5079239625a36a4bc5a89e3ea1daf39075bf\"" -> (known after apply)
      ~ id         = "focaccia:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "8688402966ae0cc4f23ef7647b5bb204e84db770" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["intaglio"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"77bf14192b5310e431d9577e81ad74c0b6896188092c297f958f8135be67795e\"" -> (known after apply)
      ~ id         = "intaglio:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "2f5def690371866a4a45023e29dd48988896f29e" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["nightly"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"005110a61a06e26993865ecae366bdb6c6fa4b84cac6ba1210a91ec660b85722\"" -> (known after apply)
      ~ id         = "nightly:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "b734301c59c6bb67b2b22b50f3b47db4fe9667ee" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["playground"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"934d4457005a3f1f47fbbcb1861d6d2a9888a204d183fabf6a7804c41d70d9d2\"" -> (known after apply)
      ~ id         = "playground:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "6a836b8dd2df6f392632dd468dbf26729dfc70a9" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["project_infrastructure"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"bdb09b685fb5f60581c666af69bec8e3a93c802ea46382742df90a8c65bd6ef8\"" -> (known after apply)
      ~ id         = "project-infrastructure:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "a641fd75d1d59663712fd454fd3e4183f7d0f8f8" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["rand_mt"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"52f0c70522bd3f87b8b880418ca09b3782489eb5bd4f1f5fc374567179ad3651\"" -> (known after apply)
      ~ id         = "rand_mt:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "ff85c23bf1544654ce249d4d9d9394fa9c54d1fa" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["raw_parts"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"d8a36fa0ad75ac1f3da6bff02e7b5901d483b5a1dd3ef4ba21bfc3e8e0b0b7c0\"" -> (known after apply)
      ~ id         = "raw-parts:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "090eb4129d2a72843d3a8b56c8db87b557cae354" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["roe"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"7b5dbd85a0bc22ad5bf785019e6981085bb9a41e73d0ad9cc7f08ed918563aa1\"" -> (known after apply)
      ~ id         = "roe:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "a8a75f9da8cd319b6b76dac67a4d9230ca8de8a9" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["ruby_file_expand_path"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"41e9445e4d3665c12ca1e0514f13f551a3a9e3161aead1dd017fe060264ea19e\"" -> (known after apply)
      ~ id         = "ruby-file-expand-path:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "d242c2eef6887c8ac894c40012aef9fcc0d916ff" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["rubyconf"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"0a34f815f33204367712a24c18752e0d23f4e5711491f57133df2d4f52c82b25\"" -> (known after apply)
      ~ id         = "rubyconf:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "d891e9d149e99096d482bb8e1267a96ade0b242f" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.github_branch.ruby_version_sync_base["strudel"] will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "ruby_version_sync_base"  {
      ~ etag       = "W/\"b523e19497baf8ffb678b19585e3203e5a6e42f237052735e36d0f14367b8c06\"" -> (known after apply)
      ~ id         = "strudel:trunk" -> (known after apply)
      ~ ref        = "refs/heads/trunk" -> (known after apply)
      ~ sha        = "1eb1bfef7a1ff18285c2ef44d9b021df460b8a3c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_repository.cactusref will be updated in-place
  ~ resource "github_repository" "cactusref" {
      ~ homepage_url           = "https://artichoke.github.io/cactusref/cactusref/" -> "https://crates.io/crates/cactusref"
        id                     = "cactusref"
        name                   = "cactusref"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

github_repository.cactusref: Modifying... [id=cactusref]
github_repository.cactusref: Modifications complete after 2s [id=cactusref]
data.github_branch.ruby_version_sync_base["docker_artichoke_nightly"]: Reading... [id=docker-artichoke-nightly:trunk]
data.github_branch.github_actions_workflows_audit_base["artichoke_github_io"]: Reading... [id=artichoke.github.io:trunk]
data.github_branch.github_actions_workflows_audit_base["cactusref"]: Reading... [id=cactusref:trunk]
data.github_branch.github_actions_workflows_audit_base["artichoke"]: Reading... [id=artichoke:trunk]
data.github_branch.ruby_version_sync_base["playground"]: Reading... [id=playground:trunk]
data.github_branch.ruby_version_sync_base["ruby_file_expand_path"]: Reading... [id=ruby-file-expand-path:trunk]
data.github_branch.github_actions_workflows_audit_base["www_artichokeruby_org"]: Reading... [id=www.artichokeruby.org:trunk]
data.github_branch.github_actions_workflows_audit_base["nightly"]: Reading... [id=nightly:trunk]
data.github_branch.ruby_version_sync_base["cactusref"]: Reading... [id=cactusref:trunk]
data.github_branch.ruby_version_sync_base["intaglio"]: Reading... [id=intaglio:trunk]
data.github_branch.ruby_version_sync_base["docker_artichoke_nightly"]: Read complete after 0s [id=docker-artichoke-nightly:trunk]
data.github_branch.github_actions_workflows_audit_base["logo"]: Reading... [id=logo:trunk]
data.github_branch.github_actions_workflows_audit_base["artichoke"]: Read complete after 0s [id=artichoke:trunk]
data.github_branch.ruby_version_sync_base["rand_mt"]: Reading... [id=rand_mt:trunk]
data.github_branch.github_actions_workflows_audit_base["artichoke_github_io"]: Read complete after 0s [id=artichoke.github.io:trunk]
data.github_branch.github_actions_workflows_audit_base["intaglio"]: Reading... [id=intaglio:trunk]
data.github_branch.ruby_version_sync_base["playground"]: Read complete after 0s [id=playground:trunk]
data.github_branch.github_actions_workflows_audit_base["playground"]: Reading... [id=playground:trunk]
data.github_branch.github_actions_workflows_audit_base["cactusref"]: Read complete after 0s [id=cactusref:trunk]
data.github_branch.ruby_version_sync_base["focaccia"]: Reading... [id=focaccia:trunk]
data.github_branch.ruby_version_sync_base["ruby_file_expand_path"]: Read complete after 1s [id=ruby-file-expand-path:trunk]
data.github_branch.ruby_version_sync_base["raw_parts"]: Reading... [id=raw-parts:trunk]
data.github_branch.github_actions_workflows_audit_base["www_artichokeruby_org"]: Read complete after 1s [id=www.artichokeruby.org:trunk]
data.github_branch.github_actions_workflows_audit_base["boba"]: Reading... [id=boba:trunk]
data.github_branch.ruby_version_sync_base["cactusref"]: Read complete after 1s [id=cactusref:trunk]
data.github_branch.ruby_version_sync_base["boba"]: Reading... [id=boba:trunk]
data.github_branch.github_actions_workflows_audit_base["nightly"]: Read complete after 1s [id=nightly:trunk]
data.github_branch.ruby_version_sync_base["strudel"]: Reading... [id=strudel:trunk]
data.github_branch.ruby_version_sync_base["intaglio"]: Read complete after 1s [id=intaglio:trunk]
data.github_branch.github_actions_workflows_audit_base["docker_artichoke_nightly"]: Reading... [id=docker-artichoke-nightly:trunk]
data.github_branch.github_actions_workflows_audit_base["logo"]: Read complete after 1s [id=logo:trunk]
data.github_branch.ruby_version_sync_base["project_infrastructure"]: Reading... [id=project-infrastructure:trunk]
data.github_branch.ruby_version_sync_base["rand_mt"]: Read complete after 2s [id=rand_mt:trunk]
data.github_branch.github_actions_workflows_audit_base["rand_mt"]: Reading... [id=rand_mt:trunk]
data.github_branch.github_actions_workflows_audit_base["intaglio"]: Read complete after 2s [id=intaglio:trunk]
data.github_branch.ruby_version_sync_base["artichoke_github_io"]: Reading... [id=artichoke.github.io:trunk]
data.github_branch.github_actions_workflows_audit_base["playground"]: Read complete after 2s [id=playground:trunk]
data.github_branch.github_actions_workflows_audit_base["strudel"]: Reading... [id=strudel:trunk]
data.github_branch.ruby_version_sync_base["focaccia"]: Read complete after 2s [id=focaccia:trunk]
data.github_branch.github_actions_workflows_audit_base["roe"]: Reading... [id=roe:trunk]
data.github_branch.ruby_version_sync_base["raw_parts"]: Read complete after 1s [id=raw-parts:trunk]
data.github_branch.ruby_version_sync_base["rubyconf"]: Reading... [id=rubyconf:trunk]
data.github_branch.github_actions_workflows_audit_base["boba"]: Read complete after 1s [id=boba:trunk]
data.github_branch.github_actions_workflows_audit_base["focaccia"]: Reading... [id=focaccia:trunk]
data.github_branch.ruby_version_sync_base["boba"]: Read complete after 1s [id=boba:trunk]
data.github_branch.ruby_version_sync_base["artichoke"]: Reading... [id=artichoke:trunk]
data.github_branch.ruby_version_sync_base["strudel"]: Read complete after 2s [id=strudel:trunk]
data.github_branch.github_actions_workflows_audit_base["project_infrastructure"]: Reading... [id=project-infrastructure:trunk]
data.github_branch.github_actions_workflows_audit_base["docker_artichoke_nightly"]: Read complete after 2s [id=docker-artichoke-nightly:trunk]
data.github_branch.github_actions_workflows_audit_base["rubyconf"]: Reading... [id=rubyconf:trunk]
data.github_branch.ruby_version_sync_base["project_infrastructure"]: Read complete after 2s [id=project-infrastructure:trunk]
data.github_branch.github_actions_workflows_audit_base["clang_format"]: Reading... [id=clang-format:trunk]
data.github_branch.github_actions_workflows_audit_base["rand_mt"]: Read complete after 1s [id=rand_mt:trunk]
data.github_branch.github_actions_workflows_audit_base["jasper"]: Reading... [id=jasper:trunk]
data.github_branch.ruby_version_sync_base["artichoke_github_io"]: Read complete after 1s [id=artichoke.github.io:trunk]
data.github_branch.ruby_version_sync_base["roe"]: Reading... [id=roe:trunk]
data.github_branch.github_actions_workflows_audit_base["strudel"]: Read complete after 1s [id=strudel:trunk]
data.github_branch.github_actions_workflows_audit_base["raw_parts"]: Reading... [id=raw-parts:trunk]
data.github_branch.github_actions_workflows_audit_base["roe"]: Read complete after 2s [id=roe:trunk]
data.github_branch.ruby_version_sync_base["nightly"]: Reading... [id=nightly:trunk]
data.github_branch.ruby_version_sync_base["rubyconf"]: Read complete after 2s [id=rubyconf:trunk]
data.github_branch.github_actions_workflows_audit_base["ruby_file_expand_path"]: Reading... [id=ruby-file-expand-path:trunk]
data.github_branch.github_actions_workflows_audit_base["focaccia"]: Read complete after 2s [id=focaccia:trunk]
data.github_branch.ruby_version_sync_base["artichoke"]: Read complete after 2s [id=artichoke:trunk]
data.github_branch.github_actions_workflows_audit_base["project_infrastructure"]: Read complete after 1s [id=project-infrastructure:trunk]
data.github_branch.github_actions_workflows_audit_base["rubyconf"]: Read complete after 1s [id=rubyconf:trunk]
data.github_branch.github_actions_workflows_audit_base["clang_format"]: Read complete after 1s [id=clang-format:trunk]
data.github_branch.github_actions_workflows_audit_base["jasper"]: Read complete after 2s [id=jasper:trunk]
data.github_branch.ruby_version_sync_base["roe"]: Read complete after 2s [id=roe:trunk]
data.github_branch.github_actions_workflows_audit_base["raw_parts"]: Read complete after 2s [id=raw-parts:trunk]
data.github_branch.ruby_version_sync_base["nightly"]: Read complete after 1s [id=nightly:trunk]
data.github_branch.github_actions_workflows_audit_base["ruby_file_expand_path"]: Read complete after 1s [id=ruby-file-expand-path:trunk]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

Outputs:

github_actions_workflows_audit_pull_requests = <<EOT
Pull Requests:
none

EOT
ruby_version_pull_requests = <<EOT

Pull Requests:
none


EOT
```

<img width="328" alt="Screen Shot 2021-11-21 at 2 25 56 PM" src="https://user-images.githubusercontent.com/860434/142781256-eafba66c-fd74-4576-a260-12172b82bc07.png">


